[{"title": "From Web Development to App Development: Embracing the Power of React Native", "image": "https://miro.medium.com/v2/resize:fill:224:224/0*bHRsF0oOxSfsY2UY.png", "url": "https://medium.com/@pranshu1902/from-web-development-to-app-development-embracing-the-power-of-react-native-3d51f5c673fe?source=user_profile---------0----------------------------", "intro": "Raise your hand if you started your coding journey with web development! It’s a common starting point, a gateway into the world of tech. But in today’s rapidly evolving landscape, can mastering web development alone truly set you apart? Let’s think beyond the familiar and explore a tech that’s both…"},{"title": "Embracing the Mobile Frontier: Exploring the Benefits of Switching from Web Development to Mobile…", "image": "https://miro.medium.com/v2/resize:fill:224:224/0*0RXTLw5KuaxoszI2.jpg", "url": "https://medium.com/@pranshu1902/embracing-the-mobile-frontier-exploring-the-benefits-of-switching-from-web-development-to-mobile-1d98185dd5e?source=user_profile---------1----------------------------", "intro": "Introduction In the ever-evolving landscape of software development, the transition from web development to mobile development has become an enticing proposition for many developers. The rise of smartphones and the increasing demand for mobile applications have paved the way for cross-platform frameworks like React Native to thrive. …"},{"title": "Revolutionizing Front-End Development: Embracing Figma’s Dev Mode", "image": "https://miro.medium.com/v2/resize:fill:224:224/0*4umqgBVQ0P1Kr3-U.jpg", "url": "https://medium.com/@pranshu1902/revolutionizing-front-end-development-embracing-figmas-dev-mode-b7151cf5c40f?source=user_profile---------2----------------------------", "intro": "Front-end development has been my passion for over a year now. From collaborating with diverse teams to crafting innovative products from scratch, I’ve navigated through countless design challenges that pushed my creative boundaries. But then, a game-changing tool entered my world — Figma. You see, I’ve been an eager observer…"}]