[{"title": "Embracing the Mobile Frontier: Exploring the Benefits of Switching from Web Development to Mobile…", "image": "https://miro.medium.com/v2/resize:fill:224:224/0*0RXTLw5KuaxoszI2.jpg", "url": "https://medium.com/@pranshu1902/embracing-the-mobile-frontier-exploring-the-benefits-of-switching-from-web-development-to-mobile-1d98185dd5e?source=user_profile---------0----------------------------", "intro": "Introduction In the ever-evolving landscape of software development, the transition from web development to mobile development has become an enticing proposition for many developers. The rise of smartphones and the increasing demand for mobile applications have paved the way for cross-platform frameworks like React Native to thrive. …"},{"title": "Revolutionizing Front-End Development: Embracing Figma’s Dev Mode", "image": "https://miro.medium.com/v2/resize:fill:224:224/0*4umqgBVQ0P1Kr3-U.jpg", "url": "https://medium.com/@pranshu1902/revolutionizing-front-end-development-embracing-figmas-dev-mode-b7151cf5c40f?source=user_profile---------1----------------------------", "intro": "Front-end development has been my passion for over a year now. From collaborating with diverse teams to crafting innovative products from scratch, I’ve navigated through countless design challenges that pushed my creative boundaries. But then, a game-changing tool entered my world — Figma. You see, I’ve been an eager observer…"},{"title": "Unveiling the Hackathon Experience: Beyond Code and Cash Prizes", "image": "https://miro.medium.com/v2/resize:fill:224:224/0*j2SLYeVUVBEFmstj", "url": "https://medium.com/@pranshu1902/unveiling-the-hackathon-experience-beyond-code-and-cash-prizes-10db7c7ea5bf?source=user_profile---------2----------------------------", "intro": "In the fast-paced world of technology, where innovation reigns supreme, hackathons have emerged as a dynamic platform for developers to showcase their skills, collaborate with like-minded individuals, and exchange creative ideas. These intensive coding events have garnered both praise and skepticism within the tech community, sparking debates about their true…"}]